#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//完数，即完美数，一个数如果恰好等于除它本身外的因子之和，这个数就称为完数
//例如6=1＋2＋3(6的因子是1,2,3)
//输入一个数字n输出从1~n范围内的所有完数，如果有则输出1~n范围内的所有完数。如果没有，则输出无！
//用一个双重for循环来遍历每一个数，外层循环来遍历每一个1~n范围中的数字，内层循环来求出每一个数的因子，
//并将其因子存入一个数组，以便对其因子进行求和判断该数是不是完数，如果是完数，则将该数存入另一个数组以便输出
int main()
{
	int i, j, k = 0, a[1000], t, n;
	printf("请输入数字n:");
	scanf("%d", &n);
	for (i = 2; i <= n; i++)
	{
		t = i;
		for (j = 1; j<i; j++)
		{
			if (i%j == 0)
				t -= j;
		}
		if (t == 0)
		{
			a[k] = i;
			k++;
		}
	}
	if (k != 0)
	{
		for (i = 0; i<k; i++)
		{
			printf("%d ", a[i]);
		}
	}
	else
	{
		printf("无!\n");

	}

	return 0;
}
